# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Always state the H0 and H1 before conducting the hypothesis test.
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents.

In [2]:
# Your code here:
# Dtaset has to be called salaries according to next task
salaries = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [3]:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN

In [4]:
salaries.tail()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
33697,"ZYLINSKA, KLAUDIA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33698,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,76266.0,NaN
33699,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33700,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33701,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DAIS,F,Salary,NaN,126732.0,NaN

In [5]:
salaries.shape

(33702, 8)

In [6]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33702 entries, 0 to 33701
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               33702 non-null  object
 1   Job Titles         33702 non-null  object
 2   Department         33702 non-null  object
 3   Full or Part-Time  33702 non-null  object
 4   Salary or Hourly   33702 non-null  object
 5   Typical Hours      8174 non-null   float64
 6   Annual Salary      25528 non-null  float64
 7   Hourly Rate        8174 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.1+ MB

In [7]:
salaries.nunique(dropna=False)

Name                 33380
Job Titles            1119
Department              36
Full or Part-Time        2
Salary or Hourly         2
Typical Hours            5
Annual Salary          925
Hourly Rate            179
dtype: int64

In [8]:
salaries.describe()

       Typical Hours  Annual Salary  Hourly Rate
count    8174.000000   25528.000000  8174.000000
mean       34.364448   89061.795000    34.586450
std         9.420849   21132.041408    13.285543
min        10.000000   14160.000000     2.650000
25%        20.000000   76266.000000    22.360000
50%        40.000000   90024.000000    37.450000
75%        40.000000   98292.000000    43.720000
max        40.000000  275004.000000   128.000000

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [9]:
salaries.isna().sum()
# .isna() create a new DataFrame of the same shape as my dataframe
    # where each element is True if the corresponding element in salaries is NaN (missing), and False otherwise.
# .sum() counting the number of missing vlaues for each column

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25528
Annual Salary         8174
Hourly Rate          25528
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [10]:
salaries['Salary or Hourly'].value_counts(dropna = False)

# .value_counts() method is applied to column and counts the frequency of each unique value in the column
# dropna=False: dropna parameter is False, NaN values are not excluded from the count

Salary    25528
Hourly     8174
Name: Salary or Hourly, dtype: int64

In [11]:
salaries['Hourly Rate'].value_counts(dropna=False)

NaN      25528
37.45     1495
43.72      779
38.52      528
19.86      345
         ...
33.00        1
52.43        1
26.90        1
21.84        1
37.69        1
Name: Hourly Rate, Length: 179, dtype: int64

In [12]:
salaries['Annual Salary'].value_counts(dropna=False)

NaN         8174
90024.0     1743
84054.0     1500
93354.0     1469
72510.0     1307
            ...
113304.0       1
107112.0       1
80088.0        1
69720.0        1
65976.0        1
Name: Annual Salary, Length: 925, dtype: int64

In [13]:
salaries['Typical Hours'].value_counts(dropna=False)

NaN     25528
40.0     5920
20.0     1928
10.0      235
35.0       91
Name: Typical Hours, dtype: int64

In [14]:
# There are 25528 NaN values in the hourly salary column (All Salary workers)
# There are 8174 NaN values in the Annual Salary column (All Hourly workers)
    # If they are a hourly worker it shows their Hourly Rate
    # If they are a salary worker it shows their Annual salary

    
# For Hourly Rate filter it so it shows only hourly employees 
    # No NaNs, because all the Hourly employees have an Hourly rate
# For Salary Workers filter it so it has only Salary workers
    # No Null vlaues in Annual salary

In [15]:
# hourly_values = np.where(salaries['Salary or Hourly'] == 'Hourly', 'Hourly', np.nan)

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [16]:
# Your code here:

# List all the departments, count the unique values for the column to get the number of employees in each department

salaries['Department'].value_counts(dropna=False)

POLICE                 13848
FIRE                    4627
STREETS & SAN           2175
WATER MGMNT             1914
AVIATION                1856
OEMC                    1737
TRANSPORTN              1113
PUBLIC LIBRARY          1088
DAIS                    1033
FAMILY & SUPPORT         656
FINANCE                  544
HEALTH                   467
LAW                      398
CITY COUNCIL             362
BUILDINGS                258
PUBLIC SAFETY ADMIN      244
BUSINESS AFFAIRS         167
HOUSING & ECON DEV       154
COPA                     123
BOARD OF ELECTION        111
MAYOR'S OFFICE           104
INSPECTOR GEN             95
CITY CLERK                88
PROCUREMENT               84
HUMAN RESOURCES           75
ANIMAL CONTRL             75
CULTURAL AFFAIRS          74
HOUSING                   66
BUDGET & MGMT             44
ADMIN HEARNG              38
DISABILITIES              28
TREASURER                 28
HUMAN RELATIONS           17
BOARD OF ETHICS            8
POLICE BOARD               2
LICENSE APPL COMM          1
Name: Department, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [17]:
# Your code here:
# Always state your H0 and H1 before you run the hypothesis test (H0 Hypothesis always have that they are equal, no difference)
    # HO Hourly workers == 30$ an hour
    # H1 Hourly workers are not equal to 30$ an hour <>
# It is two sided confidence intervall because we only want to know equal or not equal (does not matter if more or less)

# We will use the One sample test 

# Now it is important, that we filter the data in a way, that it only shows the Hourly from the Salary or Hourly column

In [18]:
# Filter for Hourly workers only 

Hourly_data = salaries[salaries['Salary or Hourly'] != 'Salary'][['Salary or Hourly', 'Hourly Rate']]
Hourly_data

      Salary or Hourly  Hourly Rate
2               Hourly        13.00
5               Hourly        37.45
15              Hourly        40.78
16              Hourly        38.52
21              Hourly        34.98
...                ...          ...
33676           Hourly        25.95
33678           Hourly        43.72
33681           Hourly        51.43
33684           Hourly        49.35
33688           Hourly        37.45

[8174 rows x 2 columns]

In [19]:
# Use boolean indexing to filter rows where "Salary or Hourly" is "Hourly."
# Select both the "Salary or Hourly" and "Hourly Rate" columns from the filtered rows.
# The hourly_data DataFrame will contain only the rows with "Salary or Hourly" as "Hourly" 
# and the corresponding values from the "Hourly Rate" column, allowing you to work with the data specific to hourly employees and their hourly rates.

In [20]:
Hourly_data['Salary or Hourly'].value_counts(dropna=False)

Hourly    8174
Name: Salary or Hourly, dtype: int64

In [21]:
# Import the library for ttest (Here double just to have all options in the example)
import scipy.stats
from scipy.stats import ttest_1samp

In [22]:
# Only Hourly from "Salary or Hourly" column is filtered
Hourly_data = salaries[salaries['Salary or Hourly'] == 'Hourly'][['Salary or Hourly', 'Hourly Rate']]
Hourly_data

      Salary or Hourly  Hourly Rate
2               Hourly        13.00
5               Hourly        37.45
15              Hourly        40.78
16              Hourly        38.52
21              Hourly        34.98
...                ...          ...
33676           Hourly        25.95
33678           Hourly        43.72
33681           Hourly        51.43
33684           Hourly        49.35
33688           Hourly        37.45

[8174 rows x 2 columns]

In [23]:
# Example from class
# stat, pval = ttest_1samp(patients, 5.6)

# State H0 and H1

# we select a value for alpha of 0.05 (p-value threshold, significance level)
# Two-sided test:
# Null hypothesis or H0: HO Hourly workers == 30$ an hour
# Alternative hyp or H1:  # H1 Hourly workers are not equal to 30$ an hour <>

In [24]:
# Always state your H0 and H1 before you run the hypothesis test (HO Hypothesis always have that they are equal, no difference)
    # HO ourly workers == 30$ an hour
    # H1 ourly workers are not equal to 30$ an hour <>
# It is two sided confidence intervall because we only want to know equal or not equal (does not matter if more or less)

In [25]:
stat, pval = ttest_1samp(Hourly_data['Hourly Rate'], 30)

In [26]:
print('stat is  ', stat)
print('pvalue for the two-tailed test is ', pval)

stat is   31.211500329216044
pvalue for the two-tailed test is  3.825475847673794e-202

In [27]:
# p value is close to 0 HO hypothesis can be rejected
    # The p value is lower than the chosen alpha value 0,05  

# The stat value is an indication, that the value might be higher than 30

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our Null hypothesis is less than or equal to, then to reject, the test statistic must be positive (rejects the <) and the p-value below 0.05 (rejects the =).

In [28]:
# Default for alpha 0.05 (95% confidence intervall)
# Here asked for higher, therefore One sided test.
# H0 Hypothesis (equal) --> Salarys > 86000 $/year
# H1 Hypothesis Salarys <= 86000 $/year

In [36]:
# Wichtig Null values have to be removed, otherwise the result will be NUll and Null

salaries_police = salaries[salaries['Department'] == 'POLICE']['Annual Salary'].dropna()

In [37]:
stat, pval = ttest_1samp(salaries_police, 86000)
print('stat for the one-tailed test is ', stat)
print('pvalue for the one-tailed test is ', pval/2)

stat for the one-tailed test is  18.51748561981861
pvalue for the one-tailed test is  6.119566952121482e-76

In [ ]:
# P value is zero 
# stat is 18

Using the `crosstab` function, find the department that has the most hourly workers.

In [ ]:
# Example from class

#data_crosstab = pd.crosstab(matrix_donors['DOMAIN'], matrix_donors['MDMAUD'], margins=False)
# If I add margins =True, I get an extra column with the total 
#data_crosstab

In [ ]:
department_hourly_counts = pd.crosstab(salaries['Department'], salaries['Salary or Hourly'], margins=False)
department_hourly_counts

In [ ]:
max_hourly_counts = department_hourly_counts.loc[department_hourly_counts['Hourly'] == department_hourly_counts['Hourly'].max()]
max_hourly_counts

# department_hourly_counts['Hourly'].max() gives me the maximum value
# department_hourly_counts.loc[department_hourly_counts['Hourly'] == (checks if any of the values are equal to max)

# loc attribute in pandas is primarily used for label-based indexing 
# specify both the row and column labels when you want to access or modify specific data within the DataFrame
# Here it selects the column for which the condition Hourly = max is true

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [ ]:

salaries_hourly_STREETS_AND_SAN = salaries[(salaries['Salary or Hourly'] == 'Hourly') & (salaries['Department'] == 'STREETS & SAN')]['Hourly Rate'].dropna()
salaries_hourly_STREETS_AND_SAN

In [ ]:
# alpha value = 0.05
# One-sided test (More or less than)
# H0 Hourly wage <= 35 per hour (is equal to the claim)
# H1 the wage is > 35 per hour (opposite of the H0 hypothesis)

stat, pval = ttest_1samp(salaries_hourly_STREETS_AND_SAN, 35)
print('stat for the one-tailed test is ', stat)
print('pvalue for the one-tailed test is ', pval/2) # Because we have a onesided test we divide the value by 2

In [ ]:
#For One tailed test we need to look at the combination of p- value and stat
# p- value lower than alpha value would indicate that we can reject the H0 hypothesis
# stat 4 lower than 35 
    # We can not reject the Ho hypothesis

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [ ]:
import scipy.stats

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [40]:
Hourly_Rate = salaries_police = salaries[salaries['Department'] == 'POLICE']['Annual Salary'].dropna()

confidence_level = 0.95
degrees_freedom = len(Hourly_Rate) - 1
sample_mean = np.mean(Hourly_Rate)
sample_standard_error = scipy.stats.sem(Hourly_Rate)

confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)
confidence_interval

(88534.1182885883, 89134.11955863392)

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [ ]:
# Your code here:

# 31 it i sless than i ti smost likely bigger than 86000 

# weept_wage_mean()

# I should be 35.55229685807026

# We faul to reject the Ho hypothesis


# It only tells us if we have evident for a statement